Revit 2027 API
ParameterTypeId.TilePatternGridCellsX Property
 "Number of horizontal cells"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TilePatternGridCellsX { get; }
Public Shared ReadOnly Property TilePatternGridCellsX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TilePatternGridCellsX {
	ForgeTypeId^ get ();
}
static member TilePatternGridCellsX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace